app/controllers/statistics_controller.rb

SELECT "statistics".* FROM "statistics"
---
  def index
    @statistics = Statistic.all

INSERT INTO "statistics" ("inf_attack", "inf_defense", "inf_health", "inf_attack_vs_player", "inf_defense_vs_player", "inf_health_vs_player", "inf_attack_vs_players_inf", "inf_attack_vs_players_ranged", "inf_attack_vs_players_cav", "inf_defense_vs_players_cav", "inf_defense_vs_players_inf", "inf_defense_vs_players_ranged", "inf_defense_vs_players_siege", "cav_attack", "cav_defense", "cav_health", "cav_attack_vs_player", "cav_defense_vs_player", "cav_health_vs_player", "cav_attack_vs_players_inf", "cav_attack_vs_players_ranged", "cav_attack_vs_players_cav", "cav_attack_vs_players_siege", "cav_defense_vs_players_cav", "cav_defense_vs_players_inf", "cav_defense_vs_players_ranged", "cav_defense_vs_players_siege", "ranged_attack", "ranged_defense", "ranged_health", "ranged_attack_vs_player", "range_defense_vs_player", "ranged_health_vs_player", "ranged_attack_vs_players_inf", "ranged_attack_vs_players_ranged", "ranged_attack_vs_players_cav", "ranged_attack_vs_players_siege", "ranged_defense_vs_players_cav", "ranged_defense_vs_players_inf", "ranged_defense_vs_players_ranged", "ranged_defense_vs_players_siege", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43) RETURNING "id"
---
  def create
    @statistic = Statistic.new(statistic_params)

    if @statistic.save

SELECT "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "statistics" SET "updated_at" = $1, "user_id" = $2 WHERE "statistics"."id" = $3  [["updated_at", "2022-01-15 04:39:24.032669"], ["user_id", 2], ["id", 2]]
---
  def update
    statistic = Statistic.find(params[:id])
    statistic.update(statistic_params)