app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "in_game_name", "allegiance", "keep_level", "house_level", "power_level", "building_power", "research_power", "troop_power", "dragon_talent_power", "armory_power", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"